/*В таблице складских запасов storehouses_products в поле value могут встречаться 
самые разные цифры: 0, если товар закончился и выше нуля, если на складе имеются запасы. 
Необходимо отсортировать записи таким образом, чтобы они выводились в порядке увеличения 
значения value. Однако, нулевые запасы должны выводиться в конце, после всех записей.
*/

-- создаем данные для таблиц products 

INSERT into  products (id ,name ,description ,price , catalog_id , created_at ) 
	values 
(1,'MacBookPro', 'Компьютер MacBookPro Retina 13', '120000', 1, '2020-03-06'),
(2,'MacBook', 'Компьютер MacBook Retina 13', '100000', 1, '2020-03-06'),
(3,'MacBookPro', 'Компьютер MacBookPro Retina 16', '160000', 1, '2020-03-06'),
(4,'Lenovo', 'Компьютер Lenovo 15', '60000', 1, '2020-03-06'),
(5,'iPhone XS', 'iPhone XS', '90000', 2, '2020-03-06'),
(6,'iPhone SE', 'iPhone SE', '70000', 2, '2020-03-06'),
(7,'iPhone X', 'iPhone X', '80000', 2, '2020-03-06'),
(8,'iPadPro', 'iPadPro', '140000', 3, '2020-03-06'),
(9,'iPadmini', 'iPadmini', '100000', 3, '2020-03-06'),
(10,'Sony', 'Sony mony', '110000', 1, '2020-03-06'),
(11,'Asus', 'Asus masus', '75000', 1, '2020-03-06'),
(12,'HP', 'HP 12', '12000', 3, '2020-03-06'),
(13,'Samsung', 'Samsung 11', '10000', 2, '2020-03-06'),
(14,'HP', 'HP', '20000', 3, '2020-03-06');

-- также создаем данные для таблицы storehauses_products
INSERT into storehauses_products (id , storehauses_id, products_id, value, created_at ) 
	values 
(1, 1, 1, 5, '2020-03-06'),
(2, 2, 2, 2, '2020-03-06'),
(3, 3, 3, 10, '2020-03-06'),
(4, 4, 4, 0, '2020-03-06'),
(5, 5, 5, 1, '2020-03-06'),
(6, 6, 6, 0, '2020-03-06'),
(7, 7, 7, 0, '2020-03-06'),
(8, 8, 8, 12, '2020-03-06'),
(9, 9, 9, 4, '2020-03-06'),
(10, 10, 10, 2, '2020-03-06'),
(11, 11, 11, 7, '2020-03-06'),
(12, 12, 12, 9, '2020-03-06'),
(13, 13, 13, 14, '2020-03-06'),
(14, 14, 14, 24, '2020-03-06');

-- вводим запрос в соответствии с условиями задачи
select * from storehauses_products sp  order by if(value = 0, 1, 0), value;


























